{"pageProps":{"metadata":{"published":true,"title":"Dungeon Generator","blurb":"Overlap some rooms, then separate. But not too much...","layout":"post","date":"May 19, 2020"},"content":"\nI have recently been making games in Godot. All kinds of different game genres. I want to play around and see what I like most. Developing games in Godot deserves an entire post or multiple to itself, but this post is about **dungeons**...\n\nEveryone and their brother has a dungeon generator and there are already fancy algorithms which generate them for you.\n\nBut I wanted to learn how they work and wanted something custom. So I made one.\n\nThe dungeons for this particular game are quite simple. There are no complex mazes or paths in between rooms.\n\n_If you just want to play with the generator, just scroll to the bottom._\n\n## The Algorithm\n\nThe general algorithm for this is as follows:\n\n- Generate a number of overlapping rectangles of different sizes (rooms)\n- While a room overlaps another\n  - Move that room one unit in a random direction\n  - If moving the room causes an \"island\" to exist, reverse that movement\n\nBut what is an _island_?\n\nFor this algorithm, an island is simply a room which does not intersect another room. But there is an edge case...\n\nIf you count a corner to corner overlap as an intersection, that may cause issues in your game. So I added a check for a _minimum overlap area_.\n\n## Let's do better.\n\nWith the algorithm above, I was able to generate small 3-5 room dungeons in around 50-100 iterations of the algorithm. But when I tried big dungeons, like 16-24 rooms, it took over a 1000 iterations and multiple seconds to solve!\n\nIn order to make this more efficient, I thought about using a set room velocity instead of always picking a random direction. This worked wonders. I had similar results and much fewer iterations. I was able to crank out a 32 room dungeon in less than a second.\n\n## Enjoy some generated dungeons.\n\n**Reset** makes a bunch of overlapping rooms\n\n**Generate** generates the dungeon all at once\n\n**Tick** generates the dungeon one step at a time\n\n<iframe style=\"width: 100%; height: 400px;\" src=\"https://jsfiddle.net/dijs/196mbuyp/embedded/result\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n","slug":"dungeon-generator","index":5,"path":"/post/dungeon-generator"},"__N_SSG":true}