{"pageProps":{"metadata":{"published":true,"title":"Ares Game","layout":"post","blurb":"Learning C++ by writing a simple MMO game","tags":["game","mmo","rpg","development"],"date":"Mar 1, 2018"},"content":"\nI have been wanting to make a proper open world mmo rpg for a very long time. I have started two or three times in the past, but after a few weeks of work and failures, the projects fizzled.\n\nThis time, I am trying to be more realistic. Instead of overwhelming myself with complex features early on, I am starting with the basics, and will build upon those.\n\nTo challenge myself even more, I will be using C++...\n\nI have only ever created one game in C before and many parts of C++ are a mystery to me, but through this project, I have already learned quite a lot, and I hope to learn much more.\n\nBecause this game will be very open, I am working on the different features of the game first, no storyline, no fancy graphics, etc.\n\nI want to start with the difficult parts first, then add in the details.\n\n### Parts of the game I have created so far:\n\n- Isometric 2D World Rendering (multiple layers)\n- Simple creature/character rendering with movement animation\n- Pathfinding / Viewport control\n- Simple chat system\n- NPC's to communicate with\n- Naive multiplayer. Can currently exist in the same world, see each other, move around, and attack\n- Mob nests and mob creatures which drop items\n- Player inventory\n- Simple combat system (works over network)\n- Tilemap/World editor for creating and updating maps\n- Skill trees\n- Quests (only hunting quests currently)\n- Keyboard shortcuts to use menus and skills (will customize later)\n- Resource scavenging\n- Item crafting using resources\n\nIt seems like a lot... for me. But there is still so much to do.\n\nFor my ALPHA version, I still want to have simple PvP, a vendor system, and player respawn working.\n\nI think with all these things working together, I can testing with other people and get a sense of what feels right and what I need to tweak.\n\nLike I said, no story or theme yet, but I wanted to share the main features that distinguish. Yes, I know none of these ideas are unique, but I hope used together properly, they will make an entertaining mmorpg.\n\n### Features:\n\n- Open world (walk ANYWHERE, I want to be able to get lost in the game 👍)\n- Attack almost anything (not sure on this one yet. I want it to be realistic here, but could cause real problems for eary players. Maybe make this a option a player can TURN ON PvP, or a designated AREA)\n- All items should be crafted / bought / sold by players (should force a real economy, must work together)\n- Player should be able to build structures (not sure on limits yet)\n- NO LEVELS. Improving in the game will be based on learning skills. You can learn skills from any profession in the game. The skill trees will be hierarchical\n\nThat's it for now.\n\nWe keep sharing thoughts and updates. And maybe a video demo soon!\n","slug":"ares-game","index":16,"path":"/post/ares-game"},"__N_SSG":true}