{"pageProps":{"metadata":{"published":true,"title":"Custom Babel Plugin","blurb":"Learning how to write plugins for Babel","layout":"post","date":"Jul 12, 2019"},"content":"\nI will assume the readers of this article know what [Babel](https://babeljs.io/) is. If not and you are a Javascript developer, please go check it out.\n\nWhen developing, I am constantly trying to be as succinct as possible in my coding. I want my code to be readable and straight to the point.\n\nTake this example:\n\n```js\nconst getRebelNames = pilots =>\n  pilots.filter(pilot => pilot.faction === 'rebel').map(pilot => pilot.name);\n```\n\nWith modern JS, it is much cleaner than we had before:\n\n```js\nfunction getRebelNames(pilots) {\n  return pilots\n    .filter(function(pilot) {\n      return pilot.faction === 'rebel';\n    })\n    .map(function() {\n      return pilot.name;\n    });\n}\n```\n\nBut, when you read these lines, they don't quite flow as much as I would desire.\n\nMy thoughts when reading\n\n```js\nmap(pilot => pilot.name);\n```\n\nare as follows...\n\n`map over ... function with pilot argument ... name property of pilot`\n\nI want better than that. In the past, I have written functions just to help with readability.\n\n```js\nconst byName = pilot => pilot.name;\nmap(byName);\n```\n\nThat is fine, but I feel that this should be built into the language itself.\n\nToday we have Babel, and so I thought I could write a plugin which adds syntax and functionality which would help me write cleaner code.\n\nI was halfway right.\n\nTurns out, adding syntax is not so easy. You can only use what Babel (through Babylon) has deemed worthy, unless you want to fork their library and write your own syntax parser addition. I had never written a Babel plugin, and I wasn't going to open yet another Pandora's box. So, sadly, I had to come up with an alternative solution: _Use valid syntax in another way to achieve my goal_.\n\nI decided to **steal** an operator which is rarely used (at least by me) to be used for another purpose.\n\nWithout further ado,\n\n```js\npilots.map(~name);\n```\n\nThe `~` operator acts as a shortcut to reading a property of the first argument in a call expression. So this code would transpile to:\n\n```js\npilots.map(_uid => _uid.name);\n```\n\nI wanted a syntax closer to\n\n```js\npilots.map(.name)\n```\n\nBut, alas, this is not possible yet. Maybe in the future Babel will support a way to introduce custom syntax.\n\nCurrently, there is support for basic use cases, but it was not my goal to support ALL use cases. I was just trying to learn how to write Babel plugins.\n\nHere is the example from above using this new feature:\n\n```js\nconst getRebelNames = pilots => pilots.filter(~faction === 'rebel').map(~name);\n```\n\nIf you are interested in using this plugin, it is available right now!\n\nHere is the npm [package](https://www.npmjs.com/package/babel-plugin-assume-first-argument)\n\nLastly, a shout out to the helpful links I found for learning:\n\n- [The Handbook](https://github.com/jamiebuilds/babel-handbook/blob/master/translations/en/plugin-handbook.md)\n- An excellent starting [repo](https://github.com/40x/babel-plugin-runtime-logger) which has easy to use tests\n","slug":"custom-babel-plugin","index":7,"path":"/post/custom-babel-plugin"},"__N_SSG":true}