{"pageProps":{"metadata":{"published":true,"title":"Static Web App","blurb":"Create apps with modern frameworks, but with fast old school static deployments","layout":"post","date":"Feb 19, 2019"},"content":"\nPage load time is an important factor when developing a website. As modern developers, we can get too focused on what our frameworks (React, Vue, Angular) are doing for us, and we forget what our users are actually being served. With our users in mind, we can continue using our frameworks, but transform what the user receives to significantly improve the performance of the site.\n\nHave you looked at the output HTML for a basic client-side React app?\nIt is the bare minimum for HTML, with some javascript to load the app. This might be fine for apps that are not user facing, Admin UI's, Internal Tools, etc. But if this is an external application which will need to be SEO friendly, this is horrible. We need to give our users **something** on the first page load!\n\nDo you remember the olden days of website programming? A different HTML file for each page where CSS and JS was sprinkled within? Sure, this eventually became a burden to maintain when applications grew large, but the benefit was **there was no magic**! There was not a bunch of different libraries transforming a bunch of independent modules, setting up communication between them, transpiling, prepping them for rendering, minifying and more.\n\nOur end users **do not care** about that.\n\n...\n\nBut developers do.\n\nThat is why these frameworks exist! Because they are incredibly helpful. [They](https://reactjs.org/) allow us to separate business logic from views and to organize our code in a well maintainable manner. [They](https://babeljs.io/) give us brand new ways to use our programming languages. [They](https://webpack.js.org/) compile all our code and resources down into a package which is easy to deploy.\n\nSo, what is my point? Why can't we have both?\n\n**You can.**\n\nI'm not talking about the server-side rendering of these frameworks. Yes, that is cool, but in that scenario the server is having to run, build, render, and serve your application for each request (*with the opportunity to cache of course*).\n\nBut what if we could do better?\n\n**You can.**\n\nWrite your app using a modern framework. Render it as a deployment step. Deploy as a pure static app, which can be hosted anywhere (AWS, Google, Github, etc). Then if you need dynamic content, fetch and handle it client-side.\n\nWith this approach, our websites can be highly maintainable, incredibly fast, and easy to deploy.\n\nTo eat my own dog food, this is exactly how I built my blog site.\n\n...\n\nI am in the process of creating a tool for developers which can help write their applications using this pattern.\n","slug":"static-web-app","index":11,"path":"/post/static-web-app"},"__N_SSG":true}